RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_mdma.h
/* MDMA access error direction */           
#define MDMA_READ_ERROR                             ((uint32_t)0x00000000U)                                 /*!< read access error */
#define MDMA_WRITE_ERROR                            MDMA_CHXSTAT1_TERRD                                     /*!< write access error */
            
/* MDMA bufferable write mode */            
#define MDMA_BUFFERABLE_WRITE_DISABLE               ((uint32_t)0x00000000U)                                 /*!< diable bufferable write mode */
#define MDMA_BUFFERABLE_WRITE_ENABLE                MDMA_CHXCFG_BWMOD                                       /*!< enable bufferable write mode */

/* MDMA flags */
#define STAT1_FLAG                                  BIT(31)                                                 /*!< flag to indicate that flag is in STAT1 register */
#define MDMA_FLAG_ERR                               MDMA_CHXSTAT0_ERR                                       /*!< channel x transfer error flag */
#define MDMA_FLAG_CHTCF                             MDMA_CHXSTAT0_CHTCF                                     /*!< channel x channel transfer complete flag */
#define MDMA_FLAG_MBTCF                             MDMA_CHXSTAT0_MBTCF                                     /*!< channel x multi-block transfer complete flag */
#define MDMA_FLAG_BTCF                              MDMA_CHXSTAT0_BTCF                                      /*!< channel x block transfer complete flag */
#define MDMA_FLAG_TCF                               MDMA_CHXSTAT0_TCF                                       /*!< channel x buffer transfer complete flag */
#define MDMA_FLAG_REQAF                             MDMA_CHXSTAT0_REQAF                                     /*!< channel x request active flag */
#define MDMA_FLAG_LDTERR                            (MDMA_CHXSTAT1_LDTERR | STAT1_FLAG)                     /*!< link data transfer error flag in the last transfer of the channel */
#define MDMA_FLAG_MDTERR                            (MDMA_CHXSTAT1_MDTERR | STAT1_FLAG)                     /*!< mask data error flag */
#define MDMA_FLAG_ASERR                             (MDMA_CHXSTAT1_ASERR | STAT1_FLAG)                      /*!< address and size error flag */
#define MDMA_FLAG_BZERR                             (MDMA_CHXSTAT1_BZERR | STAT1_FLAG)                      /*!< block size error flag */

/* MDMA interrupt */            
#define MDMA_INT_ERR                                MDMA_CHXCTL0_ERRIE                                      /*!< transfer error interrupt */
#define MDMA_INT_CHTC                               MDMA_CHXCTL0_CHTCIE                                     /*!< channel transfer complete interrupt */
#define MDMA_INT_MBTC                               MDMA_CHXCTL0_MBTCIE                                     /*!< multi-block transfer complete interrupt */
#define MDMA_INT_BTC                                MDMA_CHXCTL0_BTCIE                                      /*!< block transfer complete interrupt */
#define MDMA_INT_TC                                 MDMA_CHXCTL0_TCIE                                       /*!< buffer transfer complete interrupt */

/* MDMA interrupt flags */          
#define MDMA_INT_FLAG_ERR                           MDMA_CHXSTAT0_ERR                                       /*!< transfer error interrupt flag */
#define MDMA_INT_FLAG_CHTCF                         MDMA_CHXSTAT0_CHTCF                                     /*!< channel transfer complete interrupt flag */
#define MDMA_INT_FLAG_MBTCF                         MDMA_CHXSTAT0_MBTCF                                     /*!< multi-block transfer complete interrupt flag */
#define MDMA_INT_FLAG_BTCF                          MDMA_CHXSTAT0_BTCF                                      /*!< block transfer complete interrupt flag */
#define MDMA_INT_FLAG_TCF                           MDMA_CHXSTAT0_TCF                                       /*!< buffer transfer complete interrupt flag */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check MDMA request */
#define MDMA_REQUEST_HIGH                                           MDMA_REQUEST_OSPI1_TC
#define NOT_MDMA_REQUEST(request)                                   ((MDMA_REQUEST_HIGH < (request)) && (MDMA_REQUEST_SW != (request)))

/* check MDMA trigger transfer mode */
#define NOT_MDMA_TRANS_TRIG(trans_trig_mode)                        ((MDMA_BUFFER_TRANSFER != (trans_trig_mode))      &&  (MDMA_BLOCK_TRANSFER != (trans_trig_mode)) && \
                                                                     (MDMA_MULTI_BLOCK_TRANSFER != (trans_trig_mode)) &&  (MDMA_COMPLETE_TRANSFER != (trans_trig_mode)))

/* check MDMA software priority */
#define NOT_MDMA_PRIORITY(priority)                                 ((MDMA_PRIORITY_LOW != (priority))  && (MDMA_PRIORITY_MEDIUM != (priority)) && \
                                                                     (MDMA_PRIORITY_HIGH != (priority)) && (MDMA_PRIORITY_ULTRA_HIGH != (priority)))

/* check MDMA endianness of transactions preserve */
#define NOT_MDMA_ENDIANNESS(endianness)                             ((MDMA_LITTLE_ENDIANNESS != (endianness))  && (MDMA_BYTE_ENDIANNESS_EXCHANGE != (endianness)) && \
                                                                     (MDMA_HALFWORD_ENDIANNESS_EXCHANGE != (endianness)) && (MDMA_WORD_ENDIANNESS_EXCHANGE != (endianness)))

/* check MDMA source increment mode */
#define NOT_MDMA_SOURCE_INC(source_inc)                             ((MDMA_SOURCE_INCREASE_DISABLE != (source_inc)) && (MDMA_SOURCE_INCREASE_8BIT != (source_inc)) && \
                                                                     (MDMA_SOURCE_INCREASE_16BIT != (source_inc))   && (MDMA_SOURCE_INCREASE_32BIT != (source_inc)) && \
                                                                     (MDMA_SOURCE_INCREASE_64BIT != (source_inc))   && (MDMA_SOURCE_DECREASE_8BIT != (source_inc)) && \
                                                                     (MDMA_SOURCE_DECREASE_16BIT != (source_inc))   && (MDMA_SOURCE_DECREASE_32BIT != (source_inc)) && \
                                                                     (MDMA_SOURCE_DECREASE_64BIT != (source_inc)))

/* check MDMA destination increment mode */
#define NOT_MDMA_DEST_INC(dest_inc)                                 ((MDMA_DESTINATION_INCREASE_DISABLE != (dest_inc)) && (MDMA_DESTINATION_INCREASE_8BIT != (dest_inc)) && \
                                                                     (MDMA_DESTINATION_INCREASE_16BIT != (dest_inc))   && (MDMA_DESTINATION_INCREASE_32BIT != (dest_inc)) && \
                                                                     (MDMA_DESTINATION_INCREASE_64BIT != (dest_inc))   && (MDMA_DESTINATION_DECREASE_8BIT != (dest_inc)) && \
                                                                     (MDMA_DESTINATION_DECREASE_16BIT != (dest_inc))   && (MDMA_DESTINATION_DECREASE_32BIT != (dest_inc)) && \
                                                                     (MDMA_DESTINATION_DECREASE_64BIT != (dest_inc)))

/* check MDMA source data size */
#define NOT_MDMA_SOURCE_DATA_SIZE(source_data_size)                 ((MDMA_SOURCE_DATASIZE_8BIT != (source_data_size))  && (MDMA_SOURCE_DATASIZE_16BIT != (source_data_size)) && \
                                                                     (MDMA_SOURCE_DATASIZE_32BIT != (source_data_size)) && (MDMA_SOURCE_DATASIZE_64BIT != (source_data_size)))

