RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_mdma.h
/* check MDMA destination data size */
#define NOT_MDMA_DEST_DATA_SIZE(dest_data_size)                     ((MDMA_DESTINATION_DATASIZE_8BIT != (dest_data_size))  && (MDMA_DESTINATION_DATASIZE_16BIT != (dest_data_size)) && \
                                                                     (MDMA_DESTINATION_DATASIZE_32BIT != (dest_data_size)) && (MDMA_DESTINATION_DATASIZE_64BIT != (dest_data_size)))

/* check MDMA source to destination memory data packing/padding mode */
#define NOT_MDMA_DATA_ALIGN(data_alignment)                         ((MDMA_DATAALIGN_PKEN != (data_alignment))  && (MDMA_DATAALIGN_RIGHT != (data_alignment)) && \
                                                                     (MDMA_DATAALIGN_RIGHT_SIGNED != (data_alignment)) && (MDMA_DATAALIGN_LEFT != (data_alignment)))

/* check MDMA buffer transfer length */
#define NOT_MDMA_BUFF_TRANS_LEN_HIGH                                127U
#define NOT_MDMA_BUFF_TRANS_LEN(buff_trans_len)                     (NOT_MDMA_BUFF_TRANS_LEN_HIGH < (buff_trans_len))

/* check MDMA burst transfer configuration for the source memory transfers */
#define NOT_MDMA_SOURCE_BURST(source_burst)                         ((MDMA_SOURCE_BURST_SINGLE != (source_burst))  && (MDMA_SOURCE_BURST_2BEATS != (source_burst)) && \
                                                                     (MDMA_SOURCE_BURST_4BEATS != (source_burst)) && (MDMA_SOURCE_BURST_8BEATS != (source_burst)) && \
                                                                     (MDMA_SOURCE_BURST_16BEATS != (source_burst)) && (MDMA_SOURCE_BURST_32BEATS != (source_burst)) && \
                                                                     (MDMA_SOURCE_BURST_64BEATS != (source_burst)) && (MDMA_SOURCE_BURST_128BEATS != (source_burst)))

/* check MDMA burst transfer configuration for the destination memory transfers */
#define NOT_MDMA_DEST_BURST(dest_burst)                             ((MDMA_DESTINATION_BURST_SINGLE != (dest_burst))  && (MDMA_DESTINATION_BURST_2BEATS != (dest_burst)) && \
                                                                     (MDMA_DESTINATION_BURST_4BEATS != (dest_burst)) && (MDMA_DESTINATION_BURST_8BEATS != (dest_burst)) && \
                                                                     (MDMA_DESTINATION_BURST_16BEATS != (dest_burst)) && (MDMA_DESTINATION_BURST_32BEATS != (dest_burst)) && \
                                                                     (MDMA_DESTINATION_BURST_64BEATS != (dest_burst)) && (MDMA_DESTINATION_BURST_128BEATS != (dest_burst)))

/* check MDMA transfer bytes number of buffer/block transfer mode */
#define NOT_MDMA_TBYTES_NUM_HIGH                                    0x0001FFFFU
#define NOT_MDMA_TBYTES_NUM(tbytes_num)                             (NOT_MDMA_TBYTES_NUM_HIGH < (tbytes_num))

/* check MDMA source bus */
#define NOT_MDMA_SOURCE_BUS(source_bus)                             ((MDMA_SOURCE_AXI != (source_bus))  && (MDMA_SOURCE_AHB_TCM != (source_bus)))

/* check MDMA destination bus */
#define NOT_MDMA_DEST_BUS(dest_bus)                                 ((MDMA_DESTINATION_AXI != (dest_bus))  && (MDMA_DESTINATION_AHB_TCM != (dest_bus)))

/* check MDMA bufferable write mode */
#define NOT_MDMA_BUFFERABLE_WRITE(bufferable_write_mode)            ((MDMA_BUFFERABLE_WRITE_ENABLE != (bufferable_write_mode))  && (MDMA_BUFFERABLE_WRITE_DISABLE != (bufferable_write_mode)))

/* check MDMA transfer bytes number of buffer/block transfer mode */
#define NOT_MDMA_TBNUM_OF_BLOCK_TRANS_MODE_HIGH                     0x10000U
#define NOT_MDMA_TBNUM_OF_BLOCK_TRANS_MODE(tbnum)                   (NOT_MDMA_TBNUM_OF_BLOCK_TRANS_MODE_HIGH < (tbnum))

/* check MDMA transfer bytes number of multi block transfer mode */
#define NOT_MDMA_TBNUM_OF_MULTI_BLOCK_TRANS_MODE_HIGH               0xFFFU
#define NOT_MDMA_TBNUM_OF_MULTI_BLOCK_TRANS_MODE(tbnum)             (NOT_MDMA_TBNUM_OF_MULTI_BLOCK_TRANS_MODE_HIGH < (tbnum))

/* check MDMA multi block number */
#define NOT_MDMA_MULTI_BLOCK_NUM_HIGH                               0xFFFU
#define NOT_MDMA_MULTI_BLOCK_NUM(block_num)                         (NOT_MDMA_MULTI_BLOCK_NUM_HIGH < (block_num))

/* check MDMA flag */
#define NOT_MDMA_FLAG(flag)                                         ((MDMA_FLAG_ERR != (flag))  && (MDMA_FLAG_CHTCF != (flag)) && \
                                                                     (MDMA_FLAG_MBTCF != (flag))  && (MDMA_FLAG_BTCF != (flag)) && \
                                                                     (MDMA_FLAG_TCF != (flag))  && (MDMA_FLAG_REQAF != (flag)) && \
                                                                     (MDMA_FLAG_LDTERR != (flag))  && (MDMA_FLAG_MDTERR != (flag)) && \
                                                                     (MDMA_FLAG_ASERR != (flag))  && (MDMA_FLAG_BZERR != (flag)))

/* check MDMA clear flag */
#define NOT_MDMA_CLEAR_FLAG(flag)                                   ((MDMA_FLAG_ERR != (flag))  && (MDMA_FLAG_CHTCF != (flag)) && \
                                                                     (MDMA_FLAG_MBTCF != (flag))  && (MDMA_FLAG_BTCF != (flag)) && \
                                                                     (MDMA_FLAG_TCF != (flag))  && (MDMA_FLAG_LDTERR != (flag))&& \
                                                                     (MDMA_FLAG_MDTERR != (flag)) &&  (MDMA_FLAG_ASERR != (flag))&& \
                                                                     (MDMA_FLAG_BZERR != (flag)))

/* check MDMA interrupt */
#define NOT_MDMA_INT(interrupt)                                     ((MDMA_INT_ERR != (interrupt))  && (MDMA_INT_CHTC != (interrupt)) && \
                                                                     (MDMA_INT_MBTC != (interrupt))  && (MDMA_INT_BTC != (interrupt)) && \
                                                                     (MDMA_INT_TC != (interrupt)))

/* check MDMA interrupt flag */
#define NOT_MDMA_INT_FLAG(int_flag)                                 ((MDMA_INT_FLAG_ERR != (int_flag))  && (MDMA_INT_FLAG_CHTCF != (int_flag)) && \
                                                                     (MDMA_INT_FLAG_MBTCF != (int_flag))  && (MDMA_INT_FLAG_BTCF != (int_flag)) && \
                                                                     (MDMA_INT_FLAG_TCF != (int_flag)))

